In [1]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler, StandardScaler
from category_encoders import CountEncoder
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

In [2]:
train_df = pd.read_csv('train.csv')
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,"Partner, Mr. Austen",male,45.5,0,0,113043,28.5000,C124,S
1,0,2,"Berriman, Mr. William John",male,23.0,0,0,28425,13.0000,NaN,S
2,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
3,0,3,"Hansen, Mr. Henrik Juul",male,26.0,1,0,350025,7.8542,NaN,S
4,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.2750,NaN,S

In [3]:
test_df = pd.read_csv('test.csv')
test_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C
1,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.5000,NaN,S
2,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
3,1,2,"Harper, Miss. Annie Jessie ""Nina""",female,6.0,0,1,248727,33.0000,NaN,S
4,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C

In [4]:
def extrac_name(dataset):
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
 	'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')
    
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1
    return dataset

# train_df = extrac_name(train_df)
# test_df = extrac_name(test_df)
# train_df['Title'].value_counts()

In [5]:
train_df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         140
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       553
Embarked      2
dtype: int64

In [6]:
test_df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age          37
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       134
Embarked      0
dtype: int64

In [7]:
# train_df['sum_missing_value']= train_df.isnull().sum(axis = 1)
# test_df['sum_missing_value']= test_df.isnull().sum(axis = 1)
# train_df['is_na_age'] = train_df['Age'].isna()
# test_df['is_na_age'] = test_df['Age'].isna()

In [8]:
X_train = train_df.iloc[:, 1:].values
y_train = train_df.iloc[:, 0].values

X_test = test_df.iloc[:, 1:].values
y_test = test_df.iloc[:, 0].values

In [9]:
def missing_value(X):
    age_imputer = SimpleImputer(np.nan, strategy = 'mean')
    X[:, 3] = age_imputer.fit_transform(X[:, 3].reshape(-1, 1)).ravel()
    cabin_imputer = SimpleImputer(np.nan, strategy = 'most_frequent')
    X[:, -2] = cabin_imputer.fit_transform(X[:, -2].reshape(-1, 1)).ravel()
    embank_imputer = SimpleImputer(np.nan, strategy = 'most_frequent')
    X[:, 9] = embank_imputer.fit_transform(X[:, 9].reshape(-1, 1)).ravel()
    return X

In [10]:
X_train = missing_value(X_train)
X_test = missing_value(X_test)

In [11]:
print(X_train[0])

[1 'Partner, Mr. Austen' 'male' 45.5 0 0 '113043' 28.5 'C124' 'S']

In [12]:
train = pd.DataFrame.from_records(X_train)
train.isnull().sum()

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
dtype: int64

In [13]:
train_df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  712.000000  712.000000  572.000000  712.000000  712.000000  712.000000
mean     0.376404    2.330056   29.498846    0.553371    0.379213   32.586276
std      0.484824    0.824584   14.500059    1.176404    0.791669   51.969529
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   21.000000    0.000000    0.000000    7.925000
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   30.500000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [14]:
train_df.describe(include='O')

                                    Name   Sex    Ticket        Cabin Embarked
count                                712   712       712          159      710
unique                               712     2       558          117        3
top     Vande Velde, Mr. Johannes Joseph  male  CA. 2343  C23 C25 C27        S
freq                                   1   467         7            4      525

In [15]:
print(train_df['SibSp'].value_counts())

0    484
1    164
2     23
4     16
3     13
8      7
5      5
Name: SibSp, dtype: int64

In [16]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,"Partner, Mr. Austen",male,45.5,0,0,113043,28.5000,C124,S
1,0,2,"Berriman, Mr. William John",male,23.0,0,0,28425,13.0000,NaN,S
2,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
3,0,3,"Hansen, Mr. Henrik Juul",male,26.0,1,0,350025,7.8542,NaN,S
4,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.2750,NaN,S

## Chuẩn hóa dữ liệu

In [17]:
def Normalize(X, y):
    label_encoder = LabelEncoder()
    minmax_scaler = MinMaxScaler()
    count_encoder = CountEncoder()
    onehot_encoder = OneHotEncoder()
    
    X[:, 2] = label_encoder.fit_transform(X[:, 2]) #Sex
    X[:, 7] = minmax_scaler.fit_transform(X[:, 7].reshape(-1, 1)).ravel()#Fare
    X[:, 8] = count_encoder.fit_transform(X[:, 8].reshape(-1, 1)).values.ravel() #Cabin
    X[:, 9] = label_encoder.fit_transform(X[:, 9]) #Embarked
#     X[:, -1] = label_encoder.fit_transform(X[:, -1])
#     X[:, 10] = label_encoder.fit_transform(X[:, 10])
#     title = onehot_encoder.fit_transform(X[:, -1].reshape(-1, 1)).toarray()
#     X = np.delete(X, -1, axis = 1)
#     X = np.concatenate((X, title), axis = 1)
    
#     X = np.delete(X, 8, axis = 1)
    X = np.delete(X, 6, axis = 1)
    X = np.delete(X, 1, axis = 1)
    
    return X, y

In [18]:
print(X_train[0])

[1 'Partner, Mr. Austen' 'male' 45.5 0 0 '113043' 28.5 'C124' 'S']

In [19]:
X_train, y_train = Normalize(X_train, y_train)
X_test, y_test = Normalize(X_test, y_test)

In [20]:
print(X_train.shape, y_train.shape, X_test.shape, y_test.shape)
print(X_train[0])

(712, 8) (712,) (179, 8) (179,)
[1 1 45.5 0 0 0.055628295244541985 2 2]

In [21]:
np.random.seed(99)
clf = DecisionTreeClassifier()
clf.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [22]:
y_pred = clf.predict(X_test)

In [23]:
print("Accuracy_score:", accuracy_score(y_test, y_pred))

Accuracy_score: 0.7877094972067039